Tekla Open API Reference for Tekla Structures 2025
Model.CommitChanges Method (String)
 Commits the changes made to the model database so far. One commit is something that a user can later on undo with the undo command. A commit also launches the drawing of the changed product model to the visible views. A plug-in should never call CommitChanges, since this would make undo very difficult for the user to do.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool CommitChanges(
	string Message
)
Public Function CommitChanges (
	Message As String
) As Boolean
Parameters
Message
Type: System.String
The message to be saved with the commit.
Return Value
Type: Boolean
True on success.
See Also
Reference
Model Class
CommitChanges Overload
Tekla.Structures.Model Namespace